In [1]:
import numpy as np
import pandas as pd

In [2]:
date=pd.read_csv('orders.csv')
time=pd.read_csv('messages.csv')

In [3]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [4]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [8]:
date['date']=pd.to_datetime(date['date'])

In [7]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

In [15]:
date['month']=date['date'].dt.month

In [16]:
date

          date  product_id  city_id  orders  month  year
0   2019-12-10        5628       25       3     12  2019
1   2018-08-15        3646       14     157      8  2018
2   2018-10-23        1859       25       1     10  2018
3   2019-08-17        7292       25       1      8  2019
4   2019-01-06        4344       25       3      1  2019
..         ...         ...      ...     ...    ...   ...
995 2018-10-08         255       13       1     10  2018
996 2018-12-06        5521        7       1     12  2018
997 2019-05-07         487       26      14      5  2019
998 2019-03-03        1503       21       2      3  2019
999 2019-10-15        6371        7      22     10  2019

[1000 rows x 6 columns]

In [17]:
date['year']=date['date'].dt.year

In [18]:
date

          date  product_id  city_id  orders  month  year
0   2019-12-10        5628       25       3     12  2019
1   2018-08-15        3646       14     157      8  2018
2   2018-10-23        1859       25       1     10  2018
3   2019-08-17        7292       25       1      8  2019
4   2019-01-06        4344       25       3      1  2019
..         ...         ...      ...     ...    ...   ...
995 2018-10-08         255       13       1     10  2018
996 2018-12-06        5521        7       1     12  2018
997 2019-05-07         487       26      14      5  2019
998 2019-03-03        1503       21       2      3  2019
999 2019-10-15        6371        7      22     10  2019

[1000 rows x 6 columns]

In [19]:
date['day']=date['date'].dt.day

In [20]:
date

          date  product_id  city_id  orders  month  year  day
0   2019-12-10        5628       25       3     12  2019   10
1   2018-08-15        3646       14     157      8  2018   15
2   2018-10-23        1859       25       1     10  2018   23
3   2019-08-17        7292       25       1      8  2019   17
4   2019-01-06        4344       25       3      1  2019    6
..         ...         ...      ...     ...    ...   ...  ...
995 2018-10-08         255       13       1     10  2018    8
996 2018-12-06        5521        7       1     12  2018    6
997 2019-05-07         487       26      14      5  2019    7
998 2019-03-03        1503       21       2      3  2019    3
999 2019-10-15        6371        7      22     10  2019   15

[1000 rows x 7 columns]

In [21]:
date['month_name']=date['date'].dt.month_name()

In [22]:
date

          date  product_id  city_id  orders  month  year  day month_name
0   2019-12-10        5628       25       3     12  2019   10   December
1   2018-08-15        3646       14     157      8  2018   15     August
2   2018-10-23        1859       25       1     10  2018   23    October
3   2019-08-17        7292       25       1      8  2019   17     August
4   2019-01-06        4344       25       3      1  2019    6    January
..         ...         ...      ...     ...    ...   ...  ...        ...
995 2018-10-08         255       13       1     10  2018    8    October
996 2018-12-06        5521        7       1     12  2018    6   December
997 2019-05-07         487       26      14      5  2019    7        May
998 2019-03-03        1503       21       2      3  2019    3      March
999 2019-10-15        6371        7      22     10  2019   15    October

[1000 rows x 8 columns]

In [24]:
date['dayofweek']=date['date'].dt.dayofweek

In [25]:
date

,date,product_id,city_id,orders,month,year,day,month_name,dayofweek
0,2019-12-10,5628,25,3,12,2019,10,December,1
1,2018-08-15,3646,14,157,8,2018,15,August,2
2,2018-10-23,1859,25,1,10,2018,23,October,1
3,2019-08-17,7292,25,1,8,2019,17,August,5
4,2019-01-06,4344,25,3,1,2019,6,January,6
...,...,...,...,...,...,...,...,...,...
995,2018-10-08,255,13,1,10,2018,8,October,0
996,2018-12-06,5521,7,1,12,2018,6,December,3
997,2019-05-07,487,26,14,5,2019,7,May,1
998,2019-03-03,1503,21,2,3,2019,3,March,6
999,2019-10-15,6371,7,22,10,2019,15,October,1

In [26]:
date['dayname']=date['date'].dt.day_name()

In [27]:
date

,date,product_id,city_id,orders,month,year,day,month_name,dayofweek,dayname
0,2019-12-10,5628,25,3,12,2019,10,December,1,Tuesday
1,2018-08-15,3646,14,157,8,2018,15,August,2,Wednesday
2,2018-10-23,1859,25,1,10,2018,23,October,1,Tuesday
3,2019-08-17,7292,25,1,8,2019,17,August,5,Saturday
4,2019-01-06,4344,25,3,1,2019,6,January,6,Sunday
...,...,...,...,...,...,...,...,...,...,...
995,2018-10-08,255,13,1,10,2018,8,October,0,Monday
996,2018-12-06,5521,7,1,12,2018,6,December,3,Thursday
997,2019-05-07,487,26,14,5,2019,7,May,1,Tuesday
998,2019-03-03,1503,21,2,3,2019,3,March,6,Sunday
999,2019-10-15,6371,7,22,10,2019,15,October,1,Tuesday

In [28]:
date['dateisweekend']=np.where(date['dayname'].isin(['Saturday','Sunday']),1,0)

In [30]:
date.drop(columns=['product_id','city_id','orders']).head()

        date  month  year  day month_name  dayofweek    dayname  dateisweekend
0 2019-12-10     12  2019   10   December          1    Tuesday              0
1 2018-08-15      8  2018   15     August          2  Wednesday              0
2 2018-10-23     10  2018   23    October          1    Tuesday              0
3 2019-08-17      8  2019   17     August          5   Saturday              1
4 2019-01-06      1  2019    6    January          6     Sunday              1

In [31]:
date['quarter']=date['date'].dt.quarter

In [35]:
date.head()

,date,product_id,city_id,orders,month,year,day,month_name,dayofweek,dayname,dateisweekend,quarter
0,2019-12-10,5628,25,3,12,2019,10,December,1,Tuesday,0,4
1,2018-08-15,3646,14,157,8,2018,15,August,2,Wednesday,0,3
2,2018-10-23,1859,25,1,10,2018,23,October,1,Tuesday,0,4
3,2019-08-17,7292,25,1,8,2019,17,August,5,Saturday,1,3
4,2019-01-06,4344,25,3,1,2019,6,January,6,Sunday,1,1

In [36]:
date['semester']=np.where(date['quarter'].isin([1,2]),1,2)

In [37]:
date.head()

,date,product_id,city_id,orders,month,year,day,month_name,dayofweek,dayname,dateisweekend,quarter,semester
0,2019-12-10,5628,25,3,12,2019,10,December,1,Tuesday,0,4,2
1,2018-08-15,3646,14,157,8,2018,15,August,2,Wednesday,0,3,2
2,2018-10-23,1859,25,1,10,2018,23,October,1,Tuesday,0,4,2
3,2019-08-17,7292,25,1,8,2019,17,August,5,Saturday,1,3,2
4,2019-01-06,4344,25,3,1,2019,6,January,6,Sunday,1,1,1

In [39]:
import datetime
today=datetime.datetime.today()

In [40]:
today

datetime.datetime(2025, 12, 9, 11, 5, 50, 95059)

In [43]:
today-date['date']

0     2191 days 11:05:50.095059
1     2673 days 11:05:50.095059
2     2604 days 11:05:50.095059
3     2306 days 11:05:50.095059
4     2529 days 11:05:50.095059
                 ...
995   2619 days 11:05:50.095059
996   2560 days 11:05:50.095059
997   2408 days 11:05:50.095059
998   2473 days 11:05:50.095059
999   2247 days 11:05:50.095059
Name: date, Length: 1000, dtype: timedelta64[ns]

In [46]:
(today-date['date']).dt.days

0      2191
1      2673
2      2604
3      2306
4      2529
       ...
995    2619
996    2560
997    2408
998    2473
999    2247
Name: date, Length: 1000, dtype: int64

In [53]:
np.round((today - date['date']) / np.timedelta64(1, 'D')/30, 0)

0      73.0
1      89.0
2      87.0
3      77.0
4      84.0
       ...
995    87.0
996    85.0
997    80.0
998    82.0
999    75.0
Name: date, Length: 1000, dtype: float64

In [54]:
time

                    date                                                msg
0    2013-12-15 00:50:00                           ищу на сегодня мужика 37
1    2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2    2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3    2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4    2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше
..                   ...                                                ...
995  2012-03-16 00:50:00     ПАРЕНЬ СДЕЛАЕТ  МАССАЖ ЖЕНЩИНАМ -066-877-32-44
996  2014-01-23 23:14:00            сельский п 23 ищу девушку для отношений
997  2012-10-15 23:37:00  Д+Д ДЛЯ серьезных отношений. Мой номер 093-156...
998  2012-06-21 23:34:00  7 ДНЕПР М.34 ПОЗ.С Д/Ж ДЛЯ ВСТРЕЧ.Т.098 809 15 14
999  2014-06-19 23:25:00          Парень поласкает девушке...  т.0662035584

[1000 rows x 2 columns]

In [55]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [58]:
time['date']=pd.to_datetime(time['date'])

In [59]:
time.head()

                 date                                                msg
0 2013-12-15 00:50:00                           ищу на сегодня мужика 37
1 2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2 2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3 2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4 2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [60]:

time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

In [61]:
time['time']=time['date'].dt.time

In [63]:
time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

In [64]:
today

datetime.datetime(2025, 12, 9, 11, 5, 50, 95059)

In [65]:
today-time['date']

0     4377 days 10:15:50.095059
1     4241 days 11:25:50.095059
2     4727 days 10:44:50.095059
3     4029 days 10:34:50.095059
4     4426 days 11:54:50.095059
                 ...
995   5016 days 10:15:50.095059
996   4337 days 11:51:50.095059
997   4802 days 11:28:50.095059
998   4918 days 11:31:50.095059
999   4190 days 11:40:50.095059
Name: date, Length: 1000, dtype: timedelta64[ns]

In [66]:
# in seconds
(today-time['date'])/np.timedelta64(1,'s')

0      3.782098e+08
1      3.664636e+08
2      4.084515e+08
3      3.481437e+08
4      3.824493e+08
           ...
995    4.334194e+08
996    3.747595e+08
997    4.149341e+08
998    4.249567e+08
999    3.620581e+08
Name: date, Length: 1000, dtype: float64

In [67]:
# in minutes
(today-time['date'])/np.timedelta64(1,'m')

0      6.303496e+06
1      6.107726e+06
2      6.807525e+06
3      5.802395e+06
4      6.374155e+06
           ...
995    7.223656e+06
996    6.245992e+06
997    6.915569e+06
998    7.082612e+06
999    6.034301e+06
Name: date, Length: 1000, dtype: float64

In [68]:
# in hours
(today-time['date'])/np.timedelta64(1,'h')

0      105058.263915
1      101795.430582
2      113458.747249
3       96706.580582
4      106235.913915
           ...
995    120394.263915
996    104099.863915
997    115259.480582
998    118043.530582
999    100571.680582
Name: date, Length: 1000, dtype: float64